<a href="https://colab.research.google.com/github/PriyankaGPawar/Pandas_Practice/blob/master/PythonNotebooks/2_Selecting_Subset_of_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

## Select single column

In [0]:
# Using the brackets and dot notation provide two different ways to select a single column of data.
# Dot notation does now work for columns with spaces or columns with the same name as DataFrame methods.
# The dot notation provides no additional functionality over the brackets and does not work in all situations

In [0]:
## Minimally Sufficient Guiding Principle
      # If a method does not provide any additional functionality over another method (i.e. its functionality is 
      # a subset of another) then it shouldn't be used. 

# Methods should only be considered if they have some additional, unique functionality.

## Guidance - Only use the brackets when selecting a single column of data

In [0]:
df=pd.read_csv('https://raw.githubusercontent.com/tdpetrou/Minimally-Sufficient-Pandas/master/data/sample_data.csv')

df

        name state  color favorite food  age  height  score  count
0       Jane    NY   blue         Steak   30     165    4.6     10
1       Niko    TX  green          Lamb    2      70    8.3      4
2      Aaron    FL    red         Mango   12     120    9.0      3
3   Penelope    AL  white         Apple    4      80    3.3     12
4       Dean    AK   gray        Cheese   32     180    1.8      8
5  Christina    TX  black         Melon   33     172    9.5     99
6   Cornelia    TX    red         Beans   69     150    2.2     44

In [0]:
df.state.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: state, dtype: bool

In [0]:
df['state']

0    NY
1    TX
2    FL
3    AL
4    AK
5    TX
6    TX
Name: state, dtype: object

In [0]:
df.columns

Index(['name', 'state', 'color', 'favorite food', 'age', 'height', 'score',
       'count'],
      dtype='object')

In [0]:
df['favorite food']

0     Steak
1      Lamb
2     Mango
3     Apple
4    Cheese
5     Melon
6     Beans
Name: favorite food, dtype: object

In [0]:
df['count']

0    10
1     4
2     3
3    12
4     8
5    99
6    44
Name: count, dtype: int64

In [0]:
df.count

# count is the method in dataframes so when the column name is "count" in any dataframe, this column has to be referred as df_name['count']

<bound method DataFrame.count of         name state  color favorite food  age  height  score  count
0       Jane    NY   blue         Steak   30     165    4.6     10
1       Niko    TX  green          Lamb    2      70    8.3      4
2      Aaron    FL    red         Mango   12     120    9.0      3
3   Penelope    AL  white         Apple    4      80    3.3     12
4       Dean    AK   gray        Cheese   32     180    1.8      8
5  Christina    TX  black         Melon   33     172    9.5     99
6   Cornelia    TX    red         Beans   69     150    2.2     44>

In [0]:
 #find the count of non-NA value across the row axis
 df.count(axis=0)

name             7
state            7
color            7
favorite food    7
age              7
height           7
score            7
count            7
dtype: int64

In [0]:
#find the count of non-NA value across the column axis, this works horizontally and gives count of non null values in each row by index
df.count(axis=1)

0    8
1    8
2    8
3    8
4    8
5    8
6    8
dtype: int64

In [0]:
print(repr(df))

        name state  color favorite food  age  height  score  count
0       Jane    NY   blue         Steak   30     165    4.6     10
1       Niko    TX  green          Lamb    2      70    8.3      4
2      Aaron    FL    red         Mango   12     120    9.0      3
3   Penelope    AL  white         Apple    4      80    3.3     12
4       Dean    AK   gray        Cheese   32     180    1.8      8
5  Christina    TX  black         Melon   33     172    9.5     99
6   Cornelia    TX    red         Beans   69     150    2.2     44

In [0]:
str(df)

'        name state  color favorite food  age  height  score  count\n0       Jane    NY   blue         Steak   30     165    4.6     10\n1       Niko    TX  green          Lamb    2      70    8.3      4\n2      Aaron    FL    red         Mango   12     120    9.0      3\n3   Penelope    AL  white         Apple    4      80    3.3     12\n4       Dean    AK   gray        Cheese   32     180    1.8      8\n5  Christina    TX  black         Melon   33     172    9.5     99\n6   Cornelia    TX    red         Beans   69     150    2.2     44'

## Select multiple columns

In [0]:
df[['state', 'age', 'color']]

  state  age  color
0    NY   30   blue
1    TX    2  green
2    FL   12    red
3    AL    4  white
4    AK   32   gray
5    TX   33  black
6    TX   69    red

### For clarity, consider creating a list first

In [0]:
cols=['state', 'age', 'color']
df[cols]

  state  age  color
0    NY   30   blue
1    TX    2  green
2    FL   12    red
3    AL    4  white
4    AK   32   gray
5    TX   33  black
6    TX   69    red

## Selecting Rows and Columns Simultaneously with loc and iloc

In [0]:
# loc - access by label
# iloc - access by integer/index location

In [0]:
# Rows and columns in a Pandas DataFrame can be referenced in two ways - by either label or integer location. 
# This dual reference is one of the reasons that subset selection is confusing for beginners. 
# Pandas provides the indexers loc to handle selection by label and iloc for selection by integer location.
# Both are capable of simultaneously selecting rows and columns.

# Let's select by label with loc the rows for Niko and Dean along with the columns age, favorite food and score. 
# We create two separate lists for clarity.

## loc syntax -> df.loc[rows,columns]

In [0]:
df.columns

Index(['state', 'color', 'favorite food', 'age', 'height', 'score', 'count'], dtype='object')

In [0]:
#df.set_index('name', inplace=True)
rows = ['Jane', 'Dean']
cols = ['age', 'favorite food', 'score']
df.loc[rows,cols]

      age favorite food  score
name
Jane   30         Steak    4.6
Dean   32        Cheese    1.8

In [0]:
df.index

Index(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'], dtype='object', name='name')

## iloc syntax -> df.iloc[row_index, column_index]

In [0]:
##  syntax - df.iloc[rows, cols]

In [0]:
rows = [1, 2, 5]
cols = [0, 4]
df.iloc[rows, cols]
df.iloc[[1, 2, 5],[0,4]]

        name  age
1       Niko    2
2      Aaron   12
5  Christina   33

In [0]:
df.iloc[:,df.columns!='count']

        name state  color favorite food  age  height  score
0       Jane    NY   blue         Steak   30     165    4.6
1       Niko    TX  green          Lamb    2      70    8.3
2      Aaron    FL    red         Mango   12     120    9.0
3   Penelope    AL  white         Apple    4      80    3.3
4       Dean    AK   gray        Cheese   32     180    1.8
5  Christina    TX  black         Melon   33     172    9.5
6   Cornelia    TX    red         Beans   69     150    2.2

## filtering not null records

In [0]:
sms= pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-3/master/Projects/spam.csv', encoding='latin-1')

sms[pd.notnull(sms['Unnamed: 2'])]